# GetAnalyticalOpenings Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyAnalysisSurface..::..GetAnalyticalOpenings Method
EnergyAnalysisSurface Class See Also
---
Returns the analytical openings of the analytical surface.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public IList<EnergyAnalysisOpening> GetAnalyticalOpenings()
```

Visual Basic
---
```text
Public Function GetAnalyticalOpenings As IList(Of EnergyAnalysisOpening)
```

Visual C++
---
```text
public:
IList<EnergyAnalysisOpening^>^ GetAnalyticalOpenings()
```

# ### Return Value
The collection of analytical openings.
# See Also
EnergyAnalysisSurface Class
Autodesk.Revit.DB.Analysis Namespace